In [1]:
import pandas as pd
df=pd.DataFrame({"names":["deepu","usha","prathyu","adhi"],
                 "id":[577,101,741,618],
                  "marks":[70,80,75,85]})
print(df)

     names   id  marks
0    deepu  577     70
1     usha  101     80
2  prathyu  741     75
3     adhi  618     85

In [4]:
df.index=[10,20,30,40]
print(df)
df

      names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75
40     adhi  618     85

      names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75
40     adhi  618     85

In [5]:
df.columns

Index(['names', 'id', 'marks'], dtype='object')

In [6]:
df.index

Int64Index([10, 20, 30, 40], dtype='int64')

In [7]:
df.info

<bound method DataFrame.info of       names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75
40     adhi  618     85>

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 10 to 40
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   id      4 non-null      int64
 2   marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [9]:
df.describe()

               id      marks
count    4.000000   4.000000
mean   509.250000  77.500000
std    280.946466   6.454972
min    101.000000  70.000000
25%    458.000000  73.750000
50%    597.500000  77.500000
75%    648.750000  81.250000
max    741.000000  85.000000

In [10]:
df.size

12

In [11]:
df.shape

(4, 3)

In [12]:
df.dtypes

names    object
id        int64
marks     int64
dtype: object

In [13]:
df.dtypes.value_counts()

int64     2
object    1
dtype: int64

In [14]:
df.loc[10:30]

      names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75

In [18]:
df.iloc[0:2]

    names   id  marks
10  deepu  577     70
20   usha  101     80

In [19]:
df.loc[30]

names    prathyu
id           741
marks         75
Name: 30, dtype: object

In [20]:
df.drop(columns=["marks"])

      names   id
10    deepu  577
20     usha  101
30  prathyu  741
40     adhi  618

In [21]:
df

      names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75
40     adhi  618     85

In [22]:
df.drop([40])

      names   id  marks
10    deepu  577     70
20     usha  101     80
30  prathyu  741     75

In [25]:
df["phno"]=9876
df

      names   id  marks  phno
10    deepu  577     70  9876
20     usha  101     80  9876
30  prathyu  741     75  9876
40     adhi  618     85  9876

In [27]:
df.rename(columns={'phno':'mbno'})

      names   id  marks  mbno
10    deepu  577     70  9876
20     usha  101     80  9876
30  prathyu  741     75  9876
40     adhi  618     85  9876

In [28]:
df["names"].describe(include="a")

count        4
unique       4
top       usha
freq         1
Name: names, dtype: object

In [ ]:
import pandas as pd
a1=pd.read_csv("data.csv")

In [3]:
a1

  Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100

In [4]:
a1.head(3)

  Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400

In [5]:
a1.tail(3)

  Name  Age  Salary
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100

In [6]:
a1["Age"]>30

0    False
1     True
2    False
3    False
Name: Age, dtype: bool

In [7]:
a1[a1["Age"]>30]

  Name  Age  Salary
1  xyz   34   20000

In [8]:
a1["Age"].max()

34

In [9]:
type(a1)

pandas.core.frame.DataFrame

In [10]:
a1.describe()

             Age       Salary
count   4.000000      4.00000
mean   21.250000  14375.00000
std     9.912114   8903.32335
min    12.000000   4100.00000
25%    14.250000   8525.00000
50%    19.500000  15000.00000
75%    26.500000  20850.00000
max    34.000000  23400.00000

In [11]:
a1.info

<bound method DataFrame.info of   Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100>

In [12]:
a1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [13]:
a1["Age"]

0    12
1    34
2    24
3    15
Name: Age, dtype: int64

In [14]:
a1[["Age","Salary"]]

   Age  Salary
0   12   10000
1   34   20000
2   24   23400
3   15    4100